# YOLOv10s + Coordinate Attention

nc: 3
scales:
  s: [0.33, 0.50, 1024]

backbone:
  - [-1, 1, Conv, [64, 3, 2]]
  - [-1, 1, Conv, [128, 3, 2]]
  - [-1, 3, C2f, [128, True]]
  - [-1, 1, Conv, [256, 3, 2]]
  - [-1, 6, C2f, [256, True]]
  - [-1, 1, CoordAtt, [256]]
  - [-1, 1, SCDown, [512, 3, 2]]
  - [-1, 6, C2f, [512, True]]
  - [-1, 1, CoordAtt, [512]]
  - [-1, 1, SCDown, [1024, 3, 2]]
  - [-1, 3, C2fCIB, [1024, True, True]]
  - [-1, 1, SPPF, [1024, 5]]
  - [-1, 1, PSA, [1024]]
  - [-1, 1, CoordAtt, [1024]]

head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 8], 1, Concat, [1]]
  - [-1, 3, C2f, [512]]

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 5], 1, Concat, [1]]
  - [-1, 3, C2f, [256]]

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 16], 1, Concat, [1]]
  - [-1, 3, C2f, [512]]

  - [-1, 1, SCDown, [512, 3, 2]]
  - [[-1, 13], 1, Concat, [1]]
  - [-1, 3, C2fCIB, [1024, True, True]]

  - [[19, 22, 25], 1, v10Detect, [nc]]
